## Installing Pandas

In [3]:
#conda install pandas #or

#pip install pandas

In [6]:
import numpy as np
import pandas as pd

## Pandas Data Structures

## Series

Unlike Arrays, series is a one dimensional array that can hold various data types ranging from integers, strings, floating numbers e.t.c.
The labels of a series is called an *index*.
```
series = pd.Series(data, index = index)
```
*data* can be an array, python dictionary or scalar value.

### Creating Series from an array

In [10]:
# creating series setting index
series = pd.Series(np.random.randn(5), index = ["A","B","C","D","E"])
series, series.index

(A    0.151962
 B   -1.673988
 C    0.504916
 D   -1.151489
 E    2.006650
 dtype: float64,
 Index(['A', 'B', 'C', 'D', 'E'], dtype='object'))

In [11]:
#creating series without setting index
series2 = pd.Series(np.random.randn(5))
series2, series2.index

(0    0.592470
 1    0.137570
 2    0.271330
 3   -2.073579
 4    0.079174
 dtype: float64,
 RangeIndex(start=0, stop=5, step=1))

### Creating series from a Dictionary

In [20]:
dict = {"a":"apple","b":"boy","c":"cat","d":"dog","e":"egg"}
pd.Series(dict)

a    apple
b      boy
c      cat
d      dog
e      egg
dtype: object

In [26]:
# creating by setting index
dict = {"a":"apple","b":"boy","c":"cat","d":"dog","e":"egg"}
dict_series = pd.Series(dict, index=["a","b","c","d","e"])
dict_series

a    apple
b      boy
c      cat
d      dog
e      egg
dtype: object

### Creating from a scalar value

In [23]:
pd.Series(20.0, index=["a", "b", "c", "d", "e"])

a    20.0
b    20.0
c    20.0
d    20.0
e    20.0
dtype: float64

### Indexing and Slicing Series

In [29]:
series[1:4]

B   -1.673988
C    0.504916
D   -1.151489
dtype: float64

In [30]:
dict_series[dict_series == "apple"] #or

True

In [32]:
dict_series["a"] == "apple"

True

### Operations with Series

In [35]:
series*series+series

A    0.175054
B    1.128249
C    0.759856
D    0.174438
E    6.033292
dtype: float64

In [36]:
np.exp(series)

A    1.164116
B    0.187498
C    1.656846
D    0.316166
E    7.438354
dtype: float64

In [37]:
np.sum(series)

-0.16194992309691658

In [39]:
series[3:]+series[3:]

D   -2.302977
E    4.013299
dtype: float64

## Data Frames

This a 2-dimensional labelled pandas structures, with columns of different types. Like series, data frames can accept arrays,lits, series, another dataframe e.t.c

### Creating data frame for dictionary of series

In [45]:
dict = {
    "one": pd.Series([1.0, 2.0, 3.0], index=["a", "b", "c"]),
    "two": pd.Series([1.0, 2.0, 3.0, 4.0], index=["a", "b", "c", "d"])
}
df = pd.DataFrame(dict)
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [49]:
pd.DataFrame(dict, index=["d", "b", "c"])

   one  two
d  NaN  4.0
b  2.0  2.0
c  3.0  3.0

In [52]:
pd.DataFrame(dict, index=["d", "b", "a"], columns=["one","two", "three"])

   one  two three
d  NaN  4.0   NaN
b  2.0  2.0   NaN
a  1.0  1.0   NaN

In [53]:
df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [54]:
df.columns

Index(['one', 'two'], dtype='object')

### Creating dataframes form lists/arrays

In [60]:
data = {"one": [1.0, 2.0, 3.0, 4.0], "two": [4.0, 3.0, 2.0, 1.0]}
pd.DataFrame(data), pd.DataFrame(data, index=["a", "b", "c", "d"])

(   one  two
 0  1.0  4.0
 1  2.0  3.0
 2  3.0  2.0
 3  4.0  1.0,
    one  two
 a  1.0  4.0
 b  2.0  3.0
 c  3.0  2.0
 d  4.0  1.0)

## Column selection, addition and deletion

In [171]:
# create a dictionary of students data
students = {
    "name": ["John","Mary","Ali","Ada","Becky"],
    "sex": ["M","F","M","F","F"],
    "age": [20,14,26,18,15]
}
students

{'name': ['John', 'Mary', 'Ali', 'Ada', 'Becky'],
 'sex': ['M', 'F', 'M', 'F', 'F'],
 'age': [20, 14, 26, 18, 15]}

In [172]:
students_df = pd.DataFrame(students)
students_df

    name sex  age
0   John   M   20
1   Mary   F   14
2    Ali   M   26
3    Ada   F   18
4  Becky   F   15

In [173]:
# select only the name column
students_df["name"]

0     John
1     Mary
2      Ali
3      Ada
4    Becky
Name: name, dtype: object

In [174]:
# delete the age column
del_age = students_df.pop("age")
students_df

    name sex
0   John   M
1   Mary   F
2    Ali   M
3    Ada   F
4  Becky   F

In [175]:
students_df

    name sex
0   John   M
1   Mary   F
2    Ali   M
3    Ada   F
4  Becky   F

In [176]:
# inserting age back
students_df.insert(1, "age", del_age)

In [177]:
students_df

    name  age sex
0   John   20   M
1   Mary   14   F
2    Ali   26   M
3    Ada   18   F
4  Becky   15   F

In [184]:
#selecting row by label
students_df.loc[4]

name    Becky
age        15
sex         F
Name: 4, dtype: object

In [181]:
# selecting row by column value
students_df.loc[students_df["name"] == "Becky"]

    name  age sex
4  Becky   15   F

In [182]:
students_df.loc[students_df["age"] >= 18]

   name  age sex
0  John   20   M
2   Ali   26   M
3   Ada   18   F

## Viewing Data

In [187]:
# load sample dataset
# install seaborn
# pip install seaborn
import seaborn as sns

penguins = sns.load_dataset('penguins')

In [191]:
#Viewing top rows
penguins.head(3)

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female

In [192]:
#View bottom rows
penguins.tail(3)

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,Male
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,Female
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,Male

In [193]:
# display the data index
penguins.index

RangeIndex(start=0, stop=344, step=1)

In [194]:
# display the columns
penguins.columns

Index(['species', 'island', 'bill_length_mm', 'bill_depth_mm',
       'flipper_length_mm', 'body_mass_g', 'sex'],
      dtype='object')

In [195]:
# quick description of your data
penguins.describe()

       bill_length_mm  bill_depth_mm  flipper_length_mm  body_mass_g
count      342.000000     342.000000         342.000000   342.000000
mean        43.921930      17.151170         200.915205  4201.754386
std          5.459584       1.974793          14.061714   801.954536
min         32.100000      13.100000         172.000000  2700.000000
25%         39.225000      15.600000         190.000000  3550.000000
50%         44.450000      17.300000         197.000000  4050.000000
75%         48.500000      18.700000         213.000000  4750.000000
max         59.600000      21.500000         231.000000  6300.000000

In [196]:
#transposing your data
penguins.transpose()

,0,1,2,3,4,5,6,7,8,9,...,334,335,336,337,338,339,340,341,342,343
species,Adelie,Adelie,Adelie,Adelie,Adelie,Adelie,Adelie,Adelie,Adelie,Adelie,...,Gentoo,Gentoo,Gentoo,Gentoo,Gentoo,Gentoo,Gentoo,Gentoo,Gentoo,Gentoo
island,Torgersen,Torgersen,Torgersen,Torgersen,Torgersen,Torgersen,Torgersen,Torgersen,Torgersen,Torgersen,...,Biscoe,Biscoe,Biscoe,Biscoe,Biscoe,Biscoe,Biscoe,Biscoe,Biscoe,Biscoe
bill_length_mm,39.1,39.5,40.3,NaN,36.7,39.3,38.9,39.2,34.1,42.0,...,46.2,55.1,44.5,48.8,47.2,NaN,46.8,50.4,45.2,49.9
bill_depth_mm,18.7,17.4,18.0,NaN,19.3,20.6,17.8,19.6,18.1,20.2,...,14.1,16.0,15.7,16.2,13.7,NaN,14.3,15.7,14.8,16.1
flipper_length_mm,181.0,186.0,195.0,NaN,193.0,190.0,181.0,195.0,193.0,190.0,...,217.0,230.0,217.0,222.0,214.0,NaN,215.0,222.0,212.0,213.0
body_mass_g,3750.0,3800.0,3250.0,NaN,3450.0,3650.0,3625.0,4675.0,3475.0,4250.0,...,4375.0,5850.0,4875.0,6000.0,4925.0,NaN,4850.0,5750.0,5200.0,5400.0
sex,Male,Female,Female,NaN,Female,Male,Female,Male,NaN,NaN,...,Female,Male,NaN,Male,Female,NaN,Female,Male,Female,Male

In [200]:
# sorting data by an axis(column)
penguins.sort_index(axis = 1, ascending = True)

,bill_depth_mm,bill_length_mm,body_mass_g,flipper_length_mm,island,sex,species
0,18.7,39.1,3750.0,181.0,Torgersen,Male,Adelie
1,17.4,39.5,3800.0,186.0,Torgersen,Female,Adelie
2,18.0,40.3,3250.0,195.0,Torgersen,Female,Adelie
3,NaN,NaN,NaN,NaN,Torgersen,NaN,Adelie
4,19.3,36.7,3450.0,193.0,Torgersen,Female,Adelie
...,...,...,...,...,...,...,...
339,NaN,NaN,NaN,NaN,Biscoe,NaN,Gentoo
340,14.3,46.8,4850.0,215.0,Biscoe,Female,Gentoo
341,15.7,50.4,5750.0,222.0,Biscoe,Male,Gentoo
342,14.8,45.2,5200.0,212.0,Biscoe,Female,Gentoo
343,16.1,49.9,5400.0,213.0,Biscoe,Male,Gentoo

In [201]:
# sorting data by an axis(row)
penguins.sort_index(axis = 0, ascending = False)

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,Male
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,Female
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,Male
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,Female
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male

## Selection

In [202]:
## select two columns by names(species and island)
penguins.loc[:,["species","island"]]

    species     island
0    Adelie  Torgersen
1    Adelie  Torgersen
2    Adelie  Torgersen
3    Adelie  Torgersen
4    Adelie  Torgersen
..      ...        ...
339  Gentoo     Biscoe
340  Gentoo     Biscoe
341  Gentoo     Biscoe
342  Gentoo     Biscoe
343  Gentoo     Biscoe

[344 rows x 2 columns]

In [214]:
## select two columns by index (species and island)
penguins.iloc[:, 0:2]

    species     island
0    Adelie  Torgersen
1    Adelie  Torgersen
2    Adelie  Torgersen
3    Adelie  Torgersen
4    Adelie  Torgersen
..      ...        ...
339  Gentoo     Biscoe
340  Gentoo     Biscoe
341  Gentoo     Biscoe
342  Gentoo     Biscoe
343  Gentoo     Biscoe

[344 rows x 2 columns]

In [219]:
# select the bill length only of penguins from Gentoo Island
penguins.loc[penguins["species"] == "Gentoo", "bill_length_mm"]

220    46.1
221    50.0
222    48.7
223    50.0
224    47.6
       ...
339     NaN
340    46.8
341    50.4
342    45.2
343    49.9
Name: bill_length_mm, Length: 124, dtype: float64

In [221]:
# select penguins with body mass greater than 3000g
penguins[penguins["body_mass_g"] >= 3000]

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female
5,Adelie,Torgersen,39.3,20.6,190.0,3650.0,Male
...,...,...,...,...,...,...,...
338,Gentoo,Biscoe,47.2,13.7,214.0,4925.0,Female
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,Female
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,Male
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,Female
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,Male

## Missing Data

In [222]:
penguins.dropna()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female
5,Adelie,Torgersen,39.3,20.6,190.0,3650.0,Male
...,...,...,...,...,...,...,...
338,Gentoo,Biscoe,47.2,13.7,214.0,4925.0,Female
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,Female
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,Male
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,Female
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,Male

## Operations

In [224]:
# get mean of numerical columns
penguins.mean()

C:\Users\User\AppData\Local\Temp\ipykernel_4532\2267326756.py:2: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  penguins.mean()

bill_length_mm         43.921930
bill_depth_mm          17.151170
flipper_length_mm     200.915205
body_mass_g          4201.754386
dtype: float64

## Apply

In [243]:
penguins.iloc[:,2:6].dropna().apply(lambda x: x.max() - x.min())

bill_length_mm         27.5
bill_depth_mm           8.4
flipper_length_mm      59.0
body_mass_g          3600.0
dtype: float64

## Grouping

In [246]:
# average properties by species
penguins.groupby("species").mean()

C:\Users\User\AppData\Local\Temp\ipykernel_4532\2380979192.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  penguins.groupby("species").mean()

           bill_length_mm  bill_depth_mm  flipper_length_mm  body_mass_g
species
Adelie          38.791391      18.346358         189.953642  3700.662252
Chinstrap       48.833824      18.420588         195.823529  3733.088235
Gentoo          47.504878      14.982114         217.186992  5076.016260

In [249]:
# average body mass and bill lenght by species
penguins.groupby("species")["bill_length_mm","body_mass_g"].mean()

C:\Users\User\AppData\Local\Temp\ipykernel_4532\2540113680.py:2: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  penguins.groupby("species")["bill_length_mm","body_mass_g"].mean()

           bill_length_mm  body_mass_g
species
Adelie          38.791391  3700.662252
Chinstrap       48.833824  3733.088235
Gentoo          47.504878  5076.016260

### Categoricals

In [252]:
# create a dictionary of students data
students = {
    "name": ["John","Mary","Ali","Ada","Becky"],
    "sex": ["M","F","M","F","F"],
    "age": [20,14,26,18,15]
}
students

{'name': ['John', 'Mary', 'Ali', 'Ada', 'Becky'],
 'sex': ['M', 'F', 'M', 'F', 'F'],
 'age': [20, 14, 26, 18, 15]}

In [254]:
students_df = pd.DataFrame(students)
students_df

    name sex  age
0   John   M   20
1   Mary   F   14
2    Ali   M   26
3    Ada   F   18
4  Becky   F   15

In [256]:
students_df["categorized_sex"] = students_df["sex"].astype("category")
students_df

    name sex  age categorized_sex
0   John   M   20               M
1   Mary   F   14               F
2    Ali   M   26               M
3    Ada   F   18               F
4  Becky   F   15               F

In [262]:
# categorized age
students_df["sex"], students_df["categorized_sex"]

(0    M
 1    F
 2    M
 3    F
 4    F
 Name: sex, dtype: object,
 0    M
 1    F
 2    M
 3    F
 4    F
 Name: categorized_sex, dtype: category
 Categories (2, object): ['F', 'M'])

In [264]:
# give categories reasonable name
new_categories = ["Female","Male"]
students_df["categorized_sex"] = students_df["categorized_sex"].cat.rename_categories(new_categories)
students_df

    name sex  age categorized_sex
0   John   M   20            Male
1   Mary   F   14          Female
2    Ali   M   26            Male
3    Ada   F   18          Female
4  Becky   F   15          Female

## CSV data

In [268]:
# reading csv file
sales_csv  = pd.read_csv("sales_csv.csv")
sales_csv.head()

,date,warehouse,client_type,product_line,quantity,unit_price,total,payment
0,01/06/2021,Central,Retail,Miscellaneous,8,16.85,134.83,Credit card
1,01/06/2021,North,Retail,Breaking system,9,19.29,173.61,Cash
2,01/06/2021,North,Retail,Suspension & traction,8,32.93,263.45,Credit card
3,01/06/2021,North,Wholesale,Frame & body,16,37.84,605.44,Transfer
4,01/06/2021,Central,Retail,Engine,2,60.48,120.96,Credit card

In [271]:
# writing to csv file retail clients
retail = sales_csv.loc[sales_csv["client_type"] == "Retail"]
retail
retail.to_csv("retail.csv")

## Excel file

In [275]:
# read excel file
sales_excel  = pd.read_excel("sales_excel.xlsx", "Sheet1")
sales_excel.head()

,date,warehouse,client_type,product_line,quantity,unit_price,total,payment
0,2021-06-01,Central,Retail,Miscellaneous,8,16.85,134.83,Credit card
1,2021-06-01,North,Retail,Breaking system,9,19.29,173.61,Cash
2,2021-06-01,North,Retail,Suspension & traction,8,32.93,263.45,Credit card
3,2021-06-01,North,Wholesale,Frame & body,16,37.84,605.44,Transfer
4,2021-06-01,Central,Retail,Engine,2,60.48,120.96,Credit card

In [276]:
# writing to excel file retail clients
retail = sales_csv.loc[sales_csv["client_type"] == "Retail"]
retail
retail.to_excel("retail.xlsx")